{
  "tips": [
    "Your waifus dream in colors you've never seen. Check daily events!",
    "A pet's loyalty may unlock hidden secrets in your workshop.",
    "Rare bosses favor those who remember their first summon.",
    "Guilds whisper stories that only the diligent discover.",
    "Some waifus only evolve under a full moon.",
    "Dreams hide treasures not found in your inventory.",
    "Auction houses sometimes list items that vanish at midnight.",
    "Collecting lore books may trigger secret achievements.",
    "Mischievous waifus sometimes leave hidden clues in your gallery.",
    "Not all crafting recipes are in the workshop… some appear at random.",
    "Mood boosters work best after a rare boss fight.",
    "Your waifus talk in colors only your dreams can decode.",
    "Some achievements reveal hidden dialogue for certain characters.",
    "The stars guide your next guild activity if you pay attention.",
    "Daily rewards sometimes come with mysterious bonus items.",
    "Hidden relics may grant secret stats beyond your knowledge.",
    "Participating in fan clubs occasionally triggers unique events.",
    "Some pets have mini-quests when you interact daily.",
    "Seasonal events may unlock one-time legendary waifus.",
    "Dreams often repeat patterns; learn them to predict rewards.",
    "Duel your rivals wisely—sometimes losing teaches more than winning.",
    "Rare crafting materials might be invisible until your mood is high.",
    "Not all story choices are permanent—some echo in later events.",
    "Occasionally, interacting with a relic triggers an Easter egg scene.",
    "Certain waifus only appear when your profile reaches hidden stats.",
    "A guild's success sometimes depends on an unseen member's action.",
    "Your dream buffs may occasionally combine for extra effects.",
    "Some pets remember your past actions and react differently.",
    "Hidden lore can be found by checking events in reverse order.",
    "The auctioneer sometimes whispers hints in your notifications.",
    "Summoning multiple waifus may trigger a surprise combo scene.",
    "Your relics might glow when a special event is active.",
    "Some moods are contagious—watch your waifus carefully.",
    "Rare bosses sometimes appear when your guild reaches milestones.",
    "Certain fan clubs host secret polls with exclusive rewards.",
    "Evolving waifus may unlock hidden dialogue only shown once.",
    "Dreams occasionally give hints about crafting rare items.",
    "Using inspect during events may reveal hidden stats.",
    "Not all PvP duels are obvious—some appear spontaneously.",
    "Relics sometimes react when multiple waifus are equipped.",
    "Occasionally, your inventory may gain a mysterious item overnight.",
    "Seasonal skies change waifu moods subtly—observe carefully.",
    "Guild activity streaks may trigger secret bonuses.",
    "The first pet you adopt remembers your choices in secret ways.",
    "Some achievements unlock hidden fan club content.",
    "Dream buffs sometimes trigger mini Easter egg animations.",
    "Certain crafting recipes appear only during specific events.",
    "Your waifus sometimes leave messages in your gallery.",
    "Hidden quests occasionally appear after completing mundane tasks.",
    "Rare bosses remember who attacked them first in lore."
  ]
}